package by.bntu.fitr.povt.alexeyd.lab08;

/**
 * What is the difference between object and class in OOP (какая разница между объектом и классом в ООП)?
 *  A) Класс может инстанциировать объекты, а сам объект – нет.
 *  B) Класс может иметь много экземпляров, а объект – один или ни одного.
 *  C) Объектом всегда является более общее понятие, а классом – более конкретное.
 *  D) Класс – это исходный код, а объект – скомпилированный и выполняемый
 * код.
 *  E) Класс описывает категорию, к которой могут либо принадлежать, либо
 * не принадлежать объекты данного класса.
 *  F) Классом всегда является более общее понятие, а объектом – более конкретное.
 *  G) Объект - это экземпляр класса.
 * Answer: G
 */
public class Lab08Exercise4 {

    public static void main (String[] args) {

    }
}
