package by.bntu.fitr.povt.alexeyd.lab08;

/**
 * What is the difference between identity and equality in OOP (какая
 * разница между идентичностью и равенством в ООП)?
 * o A) Идентичность означает, что у объектов одинаковые поля, а равенство – что они содержат одинаковые данные.
 * o B) Идентичность означает, что две ссылки указывают на один и тот же
 * объект, а равенство – что они содержат одинаковые данные.
 * o C) Идентичность означает, что объекты являются экземплярами одного
 * и того же класса, а равенство – что они содержат одинаковые данные.
 * o D) Идентичность означает, что у объектов есть общий не абстрактный
 * предок, а равенство – любой общий предок
 * Answer: B
 */
public class Lab08Exercise7 {

    public static void main(String[] args) {

    }
}
