package by.bntu.fitr.povt.alexeyd.lab08;

/**
 * Choose the most appropriate class definition in OOP
 * o A) Пользовательский тип данных, содержащий набор характеристик.
 * o B) Пользовательский тип данных, содержащий набор функций.
 * o C) Пользовательский тип данных, описывающий поведение некоторой сущности.
 * o D) Пользовательский тип данных, который отображает состояние некоторого объекта.
 * o E) Пользовательский тип данных, описывающий состояние и поведение
 * объектов доменной (проблемной) области.
 * o F) Специальный тип данных.
 * Answer: E
 */
public class Lab08Exercise2 {

    public static void main (String[] args) {

    }
}
