package by.bntu.fitr.povt.alexeyd.lab07;

/**
 * What is the different between the post-condition loop and a precondition loop (какая разница между циклом с постусловием и циклом с предусловием)?
 *  A. Тело цикла с предусловием может не выполниться ни разу.
 *  B. Цикл с постусловием – это оптимизированная версия цикла с предусловием.
 *  C. Цикл с предусловием выполняется чуточку быстрее.
 *  D. Тело цикла с постусловием может не выполниться ни разу.
 *  E. Цикл с предусловие является универсальным и есть почти в любом современном я зыке программирования.
 *  F. Нет никакой принципиальной разницы.
 * Answer:
 * D. Тело цикла с постусловием может не выполниться ни разу
 */
public class Lab07Exercise4 {

    public static void main (String[] args) {

    }
}
